In [1]:
import pandas as pd
import pymysql
import requests

In [2]:
transactions = pd.read_csv('transactions.csv')

In [5]:
products = pd.read_excel('products.xlsx')

In [61]:
connection = pymysql.connect(host='localhost', user='root', password='abdan014', database='customers')
customers_df = pd.read_sql_query('SELECT * FROM customers', connection)
connection.close()

C:\Users\abdan\AppData\Local\Temp\ipykernel_6600\1556133460.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  customers_df = pd.read_sql_query('SELECT * FROM customers', connection)

In [62]:
response = requests.get('https://fakestoreapi.com/products')
shipping_data = response.json()

In [67]:
products.head()

,ID,Product Name,Category,Description,Price
0,1,Laptop,Electronics,A powerful laptop with high performance and lo...,999.99
1,2,Smartphone,Electronics,A sleek smartphone with advanced features and ...,799.99
2,3,Headphones,Electronics,High-quality headphones with noise-canceling t...,199.99
3,4,Smartwatch,Electronics,A smartwatch with fitness tracking,299.99
4,5,Bluetooth Speaker,Electronics,A portable Bluetooth speaker with deep bass an...,79.99

In [54]:
products.tail()

,ID,Product Name,Category,Description,Price
95,96,Baby Musical Toy,Baby & Kids,A musical toy for entertaining and stimulating...,12.99
96,97,Baby Floor Mirror,Baby & Kids,A large floor mirror for baby's self-discovery...,19.99
97,98,Baby Mobile,Baby & Kids,A colorful baby mobile with rotating character...,29.99
98,99,Baby Stroller Organizer,Baby & Kids,A stroller organizer with multiple pockets for...,19.99
99,100,Baby Sun Hat,Baby & Kids,A wide-brimmed sun hat for protecting baby's d...,9.99

In [68]:
products.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   ID            100 non-null    int64
 1   Product Name  100 non-null    object
 2   Category      100 non-null    object
 3   Description   100 non-null    object
 4   Price         100 non-null    float64
dtypes: float64(1), int64(1), object(3)
memory usage: 4.0+ KB

In [55]:
transactions.head()

   Transaction ID  User ID          Item Name  Quantity  Value (USD)   Status
0               1     1001         Smartphone         1       799.99  success
1               2     1002         Headphones         2       399.98  success
2               3     1003             Laptop         1       999.99  success
3               4     1004  Bluetooth Speaker         1        79.99  success
4               5     1005         Smartwatch         1       299.99  pending

In [56]:
transactions.tail()

,Transaction ID,User ID,Item Name,Quantity,Value (USD),Status
95,96,1096,Baby Musical Toy,1,12.99,success
96,97,1097,Baby Floor Mirror,1,19.99,failed
97,98,1098,Baby Mobile,1,29.99,success
98,99,1099,Baby Stroller Organizer,1,19.99,success
99,100,1100,Baby Sun Hat,1,9.99,failed

In [69]:
transactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Transaction ID  100 non-null    int64
 1   User ID         100 non-null    int64
 2   Item Name       100 non-null    object
 3   Quantity        100 non-null    int64
 4   Value (USD)     100 non-null    float64
 5   Status          100 non-null    object
dtypes: float64(1), int64(3), object(2)
memory usage: 4.8+ KB

In [70]:
customers_df.head()

              name                        email                      address
0         John Doe         john.doe@example.com   123 Main St, City, Country
1       Jane Smith       jane.smith@example.com    456 Elm St, City, Country
2  Michael Johnson  michael.johnson@example.com    789 Oak St, City, Country
3      Emily Brown      emily.brown@example.com   101 Pine St, City, Country
4   William Taylor   william.taylor@example.com  202 Maple St, City, Country

In [71]:
customers_df.tail()

            name                     email                        address
15  Evelyn Evans  evelyn.evans@example.com  1313 Walnut St, City, Country
16     Owen Hall     owen.hall@example.com  1414 Cherry St, City, Country
17    Liam Green    liam.green@example.com     1515 Oak St, City, Country
18    Avery Hill    avery.hill@example.com    1616 Pine St, City, Country
19   Lucas Baker   lucas.baker@example.com     1717 Elm St, City, Country

In [72]:
customers_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   name     20 non-null     object
 1   email    20 non-null     object
 2   address  20 non-null     object
dtypes: object(3)
memory usage: 612.0+ bytes